Repository: airow/hue
Catalog: apps/filebrowser/src/filebrowser/locale/*/LC_MESSAGES/django.po
Languages: pt

source: Max snappy decompression size in bytes.
pt: Tamanho máximo da descompressão em bytes do Snappy.

source: Location on local filesystem where the uploaded archives are temporary stored.
pt: Localização no sistema de ficheiros local onde os arquivos carregados são temporariamente armazenados.

source: File to edit
pt: Ficheiro a editar

source: Contents
pt: Conteúdo

source: Encoding
pt: Codificação

source: File to rename
pt: Ficheiro a renomear

source: The file to rename.
pt: Ficheiro cujo nome será alterado.

source: New name
pt: Novo nome

source: Rename the file to:
pt: Mudar o nome do ficheiro para:

source: File to copy
pt: Ficheiro a copiar

source: The file to copy.
pt: Ficheiro a copiar.

source: Destination location
pt: Localização do destino

source: Copy the file to:
pt: Copiar o ficheiro para:

source: File to Upload
pt: Ficheiro para upload

source: Destination Path
pt: Caminho de destino

source: Filename or directory to upload to.
pt: Nome de ficheiro ou directório para onde fazer o upload.

source: Archive to Upload
pt: Ficheiro para upload

source: Archive to upload to.
pt: Ficheiro para fazer upload para.

source: File to remove
pt: Ficheiro a remover

source: Directory to remove
pt: Directório a remover

source: Directory to remove (recursively)
pt: Directório a remover (recursivamente)

source: Path to restore
pt: Caminho a restaurar

source: Path in which to create the directory
pt: Caminho no qual o directório será criado

source: Directory Name
pt: Nome do directório

source: Path in which to create the file
pt: Caminho no qual será criado o ficheiro

source: File Name
pt: Nome do ficheiro

source: Path to change user/group ownership
pt: Caminho para alterar a propriedade de utilizador/grupo

source: User
pt: Utilizador

source: OtherUser
pt: Outro utilizador

source: Group
pt: Grupo

source: OtherGroup
pt: Outro grupo

source: Recursive
pt: Recursivo

source: Path to change permissions
pt: Caminho para alterar as permissões

source: File not found: %(path)s.
pt: Ficheiro não encontrado: %(path)s.

source: '%(path)s' is not a file.
pt: "%(path)s" não é um ficheiro.

source: Cannot access: %(path)s.
pt: Não é possível aceder a: %(path)s.

source: The HDFS REST service is not available.
pt: O serviço HDFS REST não está disponível.

source: Cannot edit a directory: %(path)s
pt: Não é possível editar um directório: %(path)s

source: File too big to edit: %(path)s
pt: Ficheiro demasiado grande para editar: %(path)s

source: File is not encoded in %(encoding)s; cannot be edited: %(path)s.
pt: Ficheiro não codificado no %(encoding)s; não é possível ser editado: %(path)s.

source: No path specified
pt: Nenhum caminho especificado

source: Not a directory: %(path)s
pt: Não é um directório: %(path)s

source: File not found: %(path)s
pt: Ficheiro não encontrado: %(path)s

source: Not a file: '%(path)s'
pt: Não é um ficheiro: '%(path)s'

source: First byte to display must be before last byte to display.
pt: O primeiro byte a apresentar deve estar antes do último byte a apresentar.

source: Mode must be one of 'binary' or 'text'.
pt: O modo tem de ser "binary" ou "text".

source: Offset may not be less than zero.
pt: O offset não pode ser inferior a zero.

source: Length may not be less than zero.
pt: O comprimento não pode ser inferior a zero.

source: Cannot request chunks greater than %(bytes)d bytes.
pt: Não é possível pedir fragmentos maiores do que %(bytes)d bytes.

source: Failed to decompress snappy compressed file.
pt: Falha ao descomprimir o ficheiro Snappy comprimido.

source: Failed to decompress snappy compressed file. Snappy is not installed.
pt: Falha ao descomprimir ficheiro comprimido snappy. O Snappy não está instalado.

source: Failed to decompress snappy compressed file. File size is greater than allowed max snappy decompression size of %d.
pt: Falha ao descomprimir o ficheiro comprimido snappy. O tamanho do ficheiro é maior que o tamanho de descompressão de snappy máximo permitido de %d

source: Failed to read Avro file.
pt: Falha ao ler o ficheiro Avro.

source: Failed to read Parquet file.
pt: Falha ao ler o ficheiro Parquet.

source: Offsets are not supported with Gzip compression.
pt: A compressão Gzip não suporta offsets.

source: Failed to decompress file.
pt: Falha ao descomprimir o ficheiro.

source: Failed to read file.
pt: Falha ao ler o ficheiro.

source: First Block
pt: Primeiro bloco

source: Previous Block
pt: Bloco anterior

source: Next Block
pt: Bloco seguinte

source: Last Block
pt: Último bloco

source: Cannot perform operation.
pt: Não é possível efectuar a operação.

source: Could not rename folder "%s" to "%s": Hashes are not allowed in filenames.
pt: Não foi possível alterar o nome da pasta "%s" para "%s": Não são permitidos hashes em nomes de ficheiros.

source: Could not name folder "%s": Slashes or hashes are not allowed in filenames.
pt: Não foi possível alterar o nome da pasta "%s": Não são permitidas barras ou hashes em nomes de ficheiros.

source: Could not name file "%s": Slashes are not allowed in filenames.
pt: Não foi possível alterar o nome do ficheiro"%s": não são permitidas barras em nomes de ficheiros.

source: Sorry, no "%(sep)s" in the filename %(name)s.sep
pt: Lamentamos, mas não existe "%(sep)s" no nome do ficheiro %(name)s.sep

source: Destination %(name)s already exists.
pt: O destino %(name)s já existe.

source: Copy to %(name)s failed: %(error)s
pt: Falha ao copiar para %(name)s: %(error)s

source: Error in upload form: %s
pt: Erro ao fazer upload do formulário: %s

source: No "%(sep)s" allowed in the filename %(name)s.sep
pt: Não é permitido nenhum "%(sep)s" no nome de ficheiro %(name)s.sep

source: Could not extract contents of file.
pt: Não foi possível extrair o conteúdo do ficheiro.

source: Could not interpret archive type.
pt: Não foi possível interpretar o tipo de ficheiro.

source: Must implement 'extract' method.
pt: É necessário implementar método de "extracção".

source: View as text
pt: Visualizar como texto

source: View as binary
pt: Visualizar como binário

source: Preview as Gzip
pt: Pré-visualizar como Gzip

source: Preview as Avro
pt: Pré-visualizar como Avro

source: Stop preview
pt: Parar a pré-visualização

source: Edit file
pt: Editar ficheiro

source: View file
pt: Visualizar ficheiro

source: Download
pt: Transferir

source: View file location
pt: Visualizar localização do ficheiro

source: Refresh
pt: Actualizar

source: Last modified
pt: Última modificação

source: Size
pt: Tamanho

source: Mode
pt: Modo

source: Page
pt: Página

source: of
pt: de

source: First page
pt: Primeira página

source: Previous page
pt: Página anterior

source: Next page
pt: Página seguinte

source: Last page
pt: Última página

source: The current file is empty.
pt: O ficheiro actual está vazio.

source: Warning: some binary data has been masked out with '&#xfffd'.
pt: Aviso: alguns dados binários foram mascarados com "&#xfffd".

source: Output rendered from compressed %s file.
pt: Resultado renderizado a partir do ficheiro %s comprimido.

source: Sorry, you cannot request for more than %s pages.
pt: Lamentamos, mas não pode pedir mais do que %s páginas.

source: There was an unexpected server error.
pt: Ocorreu um erro de servidor inesperado.

source: Save
pt: Guardar

source: Save as
pt: Guardar como

source: Enter the location where you would like to save the file.
pt: Introduza a localização onde pretende guardar o ficheiro.

source: Name is required.
pt: É necessário o nome.

source: Cancel
pt: Cancelar

source: Home
pt: Início

source: Edit path
pt: Editar caminho

source: View trash
pt: Ver o lixo

source: Trash
pt: Lixo

source: View History
pt: Visualizar histórico

source: History
pt: Histórico

source: File Browser
pt: Browser de ficheiros

source: File Operation
pt: Operação de ficheiro

source: Search for file name
pt: Pesquisar por nome de ficheiro

source: Actions
pt: Acções

source: Rename
pt: Mudar o nome

source: Move
pt: Mover

source: Copy
pt: Copiar

source: Change owner / group
pt: Alterar proprietário/grupo

source: Change permissions
pt: Alterar permissões

source: Restore from trash
pt: Restaurar do lixo

source: Restore
pt: Restaurar

source: Delete forever
pt: Eliminar permanentemente

source: Move to trash
pt: Mover para o lixo

source: Submit
pt: Enviar

source: Empty trash
pt: Esvaziar lixo

source: Upload
pt: Carregar

source: Files
pt: Ficheiros

source: Archive
pt: Ficheiro

source: New
pt: Novo

source: File
pt: Ficheiro

source: Directory
pt: Directório

source: This is Hadoop trash. Files will be under a checkpoint, or timestamp named, directory.
pt: Este está no lixo do Hadoop. Os ficheiros estarão num directório de ponto de verificação, ou com nome de carimbo de data/hora.

source: The permissions for this folder are managed by the Sentry Namenode plugin.
pt: As permissões para esta pasta são geridas pelo plug-in Sentry Namenode

source: The permissions of some of the selected files are managed by the Sentry Namenode plugin.
pt: As permissões de alguns dos ficheiros seleccionados são geridas pelo plug-in Sentry Namenode.

source: Name
pt: Nome

source: Permissions
pt: Permissões

source: Date
pt: Data

source: There are no files matching the search criteria.
pt: Não existem ficheiros que correspondam aos critérios de pesquisa.

source: Show
pt: Mostrar

source: items
pt: itens

source: No
pt: Não

source: Yes
pt: Sim

source: Confirm Delete
pt: Confirmar eliminação

source: Are you sure you want to delete these files?
pt: Tem a certeza de que pretende eliminar estes ficheiros?

source: Confirm Restore
pt: Confirmar Restaurar

source: Are you sure you want to restore these files?
pt: Tem a certeza de que pretende restaurar estes ficheiros?

source: Are you sure you want to permanently delete all your trash?
pt: Tem a certeza de que pretende eliminar de forma permanente o seu lixo?

source: Renaming:
pt: A renomear:

source: already exists.
pt: já existe.

source: Change Owner/Group
pt: Alterar proprietário/grupo

source: Other
pt: Outros

source: Read
pt: Ler

source: Write
pt: Escrever

source: Execute
pt: Executar

source: Move to
pt: Mover para

source: Select a folder or paste a path...
pt: Seleccione uma pasta ou cole um caminho copiado...

source: Required
pt: Obrigatório

source: Copy to
pt: Copiar para

source: Enable JavaScript to use the file uploader.
pt: Permitir que o JavaScript utilize o carregador de ficheiros.

source: Create Directory
pt: Criar directório

source: Directory name is required.
pt: É necessário o nome do directório.

source: Create
pt: Criar

source: Create File
pt: Criar ficheiro

source: File name is required.
pt: O nome de ficheiro é obrigatório.

source: Change owner
pt: Alterar proprietário

source: Change group
pt: Alterar grupo

source: Clear history...
pt: Eliminar histórico...

source: This folder
pt: Esta pasta

source: One level up
pt: Um nível acima

source: Items moving to
pt: A mover itens para

source: You cannot copy a folder into itself.
pt: Não pode copiar uma pasta para si mesma.

source: Select files
pt: Seleccionar ficheiros

source: Failed
pt: Falhou

source: Error:
pt: Erro:

source: Drop files here to upload
pt: Solte os ficheiros aqui para carregar

source: User is required.
pt: É necessário o utilizador.

source: Group is required.
pt: É necessário o grupo.

source: Specify another group.
pt: Especifique outro grupo.

source: Specify another user.
pt: Especifique outro utilizador.

source: Did you know? You can use the tab key or CTRL + Space to autocomplete file and folder names
pt: Sabia que pode usar a tecla de tabulação ou CTRL + Espaço para preencher automaticamente os nomes de ficheiros e pastas?

source: There was a problem with your request.
pt: Ocorreu um problema com o seu pedido.

source: Save File As...
pt: Guardar ficheiro como...
